devimpact3/app/controllers/developers_controller.rb

  def index
    @developers = Developer.all
---
SELECT "developers".* FROM "developers"

  def create
    @developer = Developer.new(developer_params)

    respond_to do |format|
      if @developer.save
---
INSERT INTO "developers" ("art_and_culture", "business_support", "children", "created_at", "developing_countries", "education", "email", "environment", "expand_in_anyway", "first_name", "food_and_water", "healthcare_and_medical_aid", "international_poverty", "last_name", "linkedin_profile", "local_poverty", "medical_research", "number_available_hours", "phone_number", "politics", "projects_you_are_interested_in", "religion", "science_research", "technology_education", "updated_at", "utilities_access", "vegetarian", "veterans", "wildlife", "world_peace", "your_skillsets", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_developer
      @developer = Developer.find(params[:id])
---
SELECT "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT 1  [["id", "1"]]